packages/framework-integration-tests/integration/provider-unaware/load/scripts/create-products-same-sku.yml
config:
  target: <not_set>
  phases:
    - duration: 5
      arrivalRate: 200
  variables:
    token: <not_set>
    sku: <not_set>
scenarios:
  - name: Create products
    flow:
      - post:
          headers:
            Authorization: "Bearer {{token}}"
          url: /
          body: '{ "query": "mutation { CreateProduct(input: { sku: \"{{sku}}\" }) }" }'