packages/framework-integration-tests/integration/provider-unaware/load/scripts/create-products-same-sku.yml
config:
  target: <not_set>
  phases:
    - duration: <not_set>
      arrivalRate: <not_set>
  variables:
    token: <not_set>
    sku: <not_set>
scenarios:
  - name: Create products
    flow:
      - post:
          url: /
          headers:
            Authorization: "Bearer {{token}}"
          body: '{ "query": "mutation { CreateProduct(input: { sku: \"{{sku}}\" }) }" }'